test-stress-results/k6-stress-fastapi-cpu-results.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: /stress.js
     output: -

  scenarios: (100.00%) 1 scenario, 30 max VUs, 3m0s max duration (incl. graceful stop):
           * default: Up to 30 looping VUs for 2m30s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/30 VUs, 7 complete and 0 interrupted iterations
default   [   1% ] 01/30 VUs  0m01.0s/2m30.0s

running (0m02.0s), 01/30 VUs, 13 complete and 0 interrupted iterations
default   [   1% ] 01/30 VUs  0m02.0s/2m30.0s

running (0m03.0s), 01/30 VUs, 19 complete and 0 interrupted iterations
default   [   2% ] 01/30 VUs  0m03.0s/2m30.0s

running (0m04.0s), 02/30 VUs, 27 complete and 0 interrupted iterations
default   [   3% ] 02/30 VUs  0m04.0s/2m30.0s

running (0m05.0s), 02/30 VUs, 41 complete and 0 interrupted iterations
default   [   3% ] 02/30 VUs  0m05.0s/2m30.0s

running (0m06.0s), 02/30 VUs, 53 complete and 0 interrupted iterations
default   [   4% ] 02/30 VUs  0m06.0s/2m30.0s

running (0m07.0s), 03/30 VUs, 63 complete and 0 interrupted iterations
default   [   5% ] 03/30 VUs  0m07.0s/2m30.0s

running (0m08.0s), 03/30 VUs, 76 complete and 0 interrupted iterations
default   [   5% ] 03/30 VUs  0m08.0s/2m30.0s

running (0m09.0s), 03/30 VUs, 86 complete and 0 interrupted iterations
default   [   6% ] 03/30 VUs  0m09.0s/2m30.0s

running (0m10.0s), 03/30 VUs, 94 complete and 0 interrupted iterations
default   [   7% ] 03/30 VUs  0m10.0s/2m30.0s

running (0m11.0s), 04/30 VUs, 104 complete and 0 interrupted iterations
default   [   7% ] 04/30 VUs  0m11.0s/2m30.0s

running (0m12.0s), 04/30 VUs, 121 complete and 0 interrupted iterations
default   [   8% ] 04/30 VUs  0m12.0s/2m30.0s

running (0m13.0s), 04/30 VUs, 133 complete and 0 interrupted iterations
default   [   9% ] 04/30 VUs  0m13.0s/2m30.0s

running (0m14.0s), 05/30 VUs, 145 complete and 0 interrupted iterations
default   [   9% ] 05/30 VUs  0m14.0s/2m30.0s

running (0m15.0s), 05/30 VUs, 156 complete and 0 interrupted iterations
default   [  10% ] 05/30 VUs  0m15.0s/2m30.0s

running (0m16.0s), 05/30 VUs, 166 complete and 0 interrupted iterations
default   [  11% ] 05/30 VUs  0m16.0s/2m30.0s

running (0m17.0s), 06/30 VUs, 176 complete and 0 interrupted iterations
default   [  11% ] 06/30 VUs  0m17.0s/2m30.0s

running (0m18.0s), 06/30 VUs, 186 complete and 0 interrupted iterations
default   [  12% ] 06/30 VUs  0m18.0s/2m30.0s

running (0m19.0s), 06/30 VUs, 193 complete and 0 interrupted iterations
default   [  13% ] 06/30 VUs  0m19.0s/2m30.0s

running (0m20.0s), 06/30 VUs, 206 complete and 0 interrupted iterations
default   [  13% ] 06/30 VUs  0m20.0s/2m30.0s

running (0m21.0s), 07/30 VUs, 214 complete and 0 interrupted iterations
default   [  14% ] 07/30 VUs  0m21.0s/2m30.0s

running (0m22.0s), 07/30 VUs, 222 complete and 0 interrupted iterations
default   [  15% ] 07/30 VUs  0m22.0s/2m30.0s

running (0m23.0s), 07/30 VUs, 232 complete and 0 interrupted iterations
default   [  15% ] 07/30 VUs  0m23.0s/2m30.0s

running (0m24.0s), 08/30 VUs, 240 complete and 0 interrupted iterations
default   [  16% ] 08/30 VUs  0m24.0s/2m30.0s

running (0m25.0s), 08/30 VUs, 252 complete and 0 interrupted iterations
default   [  17% ] 08/30 VUs  0m25.0s/2m30.0s

running (0m26.0s), 08/30 VUs, 268 complete and 0 interrupted iterations
default   [  17% ] 08/30 VUs  0m26.0s/2m30.0s

running (0m27.0s), 09/30 VUs, 279 complete and 0 interrupted iterations
default   [  18% ] 09/30 VUs  0m27.0s/2m30.0s

running (0m28.0s), 09/30 VUs, 290 complete and 0 interrupted iterations
default   [  19% ] 09/30 VUs  0m28.0s/2m30.0s

running (0m29.0s), 09/30 VUs, 301 complete and 0 interrupted iterations
default   [  19% ] 09/30 VUs  0m29.0s/2m30.0s

running (0m30.0s), 09/30 VUs, 307 complete and 0 interrupted iterations
default   [  20% ] 09/30 VUs  0m30.0s/2m30.0s

running (0m31.0s), 10/30 VUs, 316 complete and 0 interrupted iterations
default   [  21% ] 10/30 VUs  0m31.0s/2m30.0s

running (0m32.0s), 10/30 VUs, 328 complete and 0 interrupted iterations
default   [  21% ] 10/30 VUs  0m32.0s/2m30.0s

running (0m32.9s), 10/30 VUs, 333 complete and 0 interrupted iterations
default   [  22% ] 10/30 VUs  0m33.0s/2m30.0s

running (0m33.9s), 11/30 VUs, 346 complete and 0 interrupted iterations
default   [  23% ] 11/30 VUs  0m34.0s/2m30.0s

running (0m34.9s), 11/30 VUs, 359 complete and 0 interrupted iterations
default   [  23% ] 11/30 VUs  0m35.0s/2m30.0s

running (0m35.9s), 11/30 VUs, 368 complete and 0 interrupted iterations
default   [  24% ] 11/30 VUs  0m36.0s/2m30.0s

running (0m36.9s), 12/30 VUs, 381 complete and 0 interrupted iterations
default   [  25% ] 12/30 VUs  0m37.0s/2m30.0s

running (0m37.9s), 12/30 VUs, 392 complete and 0 interrupted iterations
default   [  25% ] 12/30 VUs  0m38.0s/2m30.0s

running (0m38.9s), 12/30 VUs, 398 complete and 0 interrupted iterations
default   [  26% ] 12/30 VUs  0m39.0s/2m30.0s

running (0m39.9s), 13/30 VUs, 406 complete and 0 interrupted iterations
default   [  27% ] 13/30 VUs  0m40.0s/2m30.0s

running (0m40.9s), 13/30 VUs, 418 complete and 0 interrupted iterations
default   [  27% ] 13/30 VUs  0m41.0s/2m30.0s

running (0m41.9s), 13/30 VUs, 423 complete and 0 interrupted iterations
default   [  28% ] 13/30 VUs  0m42.0s/2m30.0s

running (0m42.9s), 14/30 VUs, 434 complete and 0 interrupted iterations
default   [  29% ] 14/30 VUs  0m43.0s/2m30.0s

running (0m43.9s), 14/30 VUs, 443 complete and 0 interrupted iterations
default   [  29% ] 14/30 VUs  0m44.0s/2m30.0s

running (0m44.9s), 14/30 VUs, 453 complete and 0 interrupted iterations
default   [  30% ] 14/30 VUs  0m45.0s/2m30.0s

running (0m45.9s), 15/30 VUs, 463 complete and 0 interrupted iterations
default   [  31% ] 15/30 VUs  0m46.0s/2m30.0s

running (0m46.9s), 15/30 VUs, 471 complete and 0 interrupted iterations
default   [  31% ] 15/30 VUs  0m47.0s/2m30.0s

running (0m47.9s), 15/30 VUs, 482 complete and 0 interrupted iterations
default   [  32% ] 15/30 VUs  0m48.0s/2m30.0s

running (0m48.9s), 16/30 VUs, 490 complete and 0 interrupted iterations
default   [  33% ] 16/30 VUs  0m49.0s/2m30.0s

running (0m49.9s), 16/30 VUs, 497 complete and 0 interrupted iterations
default   [  33% ] 16/30 VUs  0m50.0s/2m30.0s

running (0m50.9s), 16/30 VUs, 510 complete and 0 interrupted iterations
default   [  34% ] 16/30 VUs  0m51.0s/2m30.0s

running (0m51.9s), 17/30 VUs, 521 complete and 0 interrupted iterations
default   [  35% ] 17/30 VUs  0m52.0s/2m30.0s

running (0m52.9s), 17/30 VUs, 532 complete and 0 interrupted iterations
default   [  35% ] 17/30 VUs  0m53.0s/2m30.0s

running (0m53.9s), 17/30 VUs, 539 complete and 0 interrupted iterations
default   [  36% ] 17/30 VUs  0m54.0s/2m30.0s

running (0m54.9s), 18/30 VUs, 551 complete and 0 interrupted iterations
default   [  37% ] 18/30 VUs  0m55.0s/2m30.0s

running (0m55.9s), 18/30 VUs, 560 complete and 0 interrupted iterations
default   [  37% ] 18/30 VUs  0m56.0s/2m30.0s

running (0m56.9s), 18/30 VUs, 568 complete and 0 interrupted iterations
default   [  38% ] 18/30 VUs  0m57.0s/2m30.0s

running (0m57.9s), 19/30 VUs, 580 complete and 0 interrupted iterations
default   [  39% ] 19/30 VUs  0m58.0s/2m30.0s

running (0m58.9s), 19/30 VUs, 591 complete and 0 interrupted iterations
default   [  39% ] 19/30 VUs  0m59.0s/2m30.0s

running (0m59.9s), 19/30 VUs, 602 complete and 0 interrupted iterations
default   [  40% ] 19/30 VUs  1m00.0s/2m30.0s

running (1m01.0s), 20/30 VUs, 610 complete and 0 interrupted iterations
default   [  41% ] 20/30 VUs  1m01.0s/2m30.0s

running (1m01.9s), 20/30 VUs, 620 complete and 0 interrupted iterations
default   [  41% ] 20/30 VUs  1m02.0s/2m30.0s

running (1m02.9s), 20/30 VUs, 625 complete and 0 interrupted iterations
default   [  42% ] 20/30 VUs  1m03.0s/2m30.0s

running (1m03.9s), 20/30 VUs, 637 complete and 0 interrupted iterations
default   [  43% ] 20/30 VUs  1m04.0s/2m30.0s

running (1m04.9s), 20/30 VUs, 647 complete and 0 interrupted iterations
default   [  43% ] 20/30 VUs  1m05.0s/2m30.0s

running (1m05.9s), 20/30 VUs, 654 complete and 0 interrupted iterations
default   [  44% ] 20/30 VUs  1m06.0s/2m30.0s

running (1m07.0s), 21/30 VUs, 662 complete and 0 interrupted iterations
default   [  45% ] 21/30 VUs  1m07.0s/2m30.0s

running (1m07.9s), 21/30 VUs, 669 complete and 0 interrupted iterations
default   [  45% ] 21/30 VUs  1m08.0s/2m30.0s

running (1m08.9s), 21/30 VUs, 680 complete and 0 interrupted iterations
default   [  46% ] 21/30 VUs  1m09.0s/2m30.0s

running (1m10.0s), 21/30 VUs, 686 complete and 0 interrupted iterations
default   [  47% ] 21/30 VUs  1m10.0s/2m30.0s

running (1m10.9s), 21/30 VUs, 691 complete and 0 interrupted iterations
default   [  47% ] 21/30 VUs  1m11.0s/2m30.0s

running (1m11.9s), 21/30 VUs, 700 complete and 0 interrupted iterations
default   [  48% ] 21/30 VUs  1m12.0s/2m30.0s

running (1m12.9s), 22/30 VUs, 704 complete and 0 interrupted iterations
default   [  49% ] 22/30 VUs  1m13.0s/2m30.0s

running (1m13.9s), 22/30 VUs, 716 complete and 0 interrupted iterations
default   [  49% ] 22/30 VUs  1m14.0s/2m30.0s

running (1m14.9s), 22/30 VUs, 725 complete and 0 interrupted iterations
default   [  50% ] 22/30 VUs  1m15.0s/2m30.0s

running (1m15.9s), 22/30 VUs, 731 complete and 0 interrupted iterations
default   [  51% ] 22/30 VUs  1m16.0s/2m30.0s

running (1m16.9s), 22/30 VUs, 740 complete and 0 interrupted iterations
default   [  51% ] 22/30 VUs  1m17.0s/2m30.0s

running (1m17.9s), 22/30 VUs, 747 complete and 0 interrupted iterations
default   [  52% ] 22/30 VUs  1m18.0s/2m30.0s

running (1m18.9s), 23/30 VUs, 753 complete and 0 interrupted iterations
default   [  53% ] 23/30 VUs  1m19.0s/2m30.0s

running (1m19.9s), 23/30 VUs, 762 complete and 0 interrupted iterations
default   [  53% ] 23/30 VUs  1m20.0s/2m30.0s

running (1m20.9s), 23/30 VUs, 769 complete and 0 interrupted iterations
default   [  54% ] 23/30 VUs  1m21.0s/2m30.0s

running (1m22.0s), 23/30 VUs, 775 complete and 0 interrupted iterations
default   [  55% ] 23/30 VUs  1m22.0s/2m30.0s

running (1m22.9s), 23/30 VUs, 784 complete and 0 interrupted iterations
default   [  55% ] 23/30 VUs  1m23.0s/2m30.0s

running (1m23.9s), 23/30 VUs, 791 complete and 0 interrupted iterations
default   [  56% ] 23/30 VUs  1m24.0s/2m30.0s

running (1m24.9s), 24/30 VUs, 798 complete and 0 interrupted iterations
default   [  57% ] 24/30 VUs  1m25.0s/2m30.0s

running (1m25.9s), 24/30 VUs, 807 complete and 0 interrupted iterations
default   [  57% ] 24/30 VUs  1m26.0s/2m30.0s

running (1m26.9s), 24/30 VUs, 818 complete and 0 interrupted iterations
default   [  58% ] 24/30 VUs  1m27.0s/2m30.0s

running (1m27.9s), 24/30 VUs, 823 complete and 0 interrupted iterations
default   [  59% ] 24/30 VUs  1m28.0s/2m30.0s

running (1m29.0s), 24/30 VUs, 836 complete and 0 interrupted iterations
default   [  59% ] 24/30 VUs  1m29.0s/2m30.0s

running (1m29.9s), 24/30 VUs, 842 complete and 0 interrupted iterations
default   [  60% ] 24/30 VUs  1m30.0s/2m30.0s

running (1m31.0s), 25/30 VUs, 852 complete and 0 interrupted iterations
default   [  61% ] 25/30 VUs  1m31.0s/2m30.0s

running (1m31.9s), 25/30 VUs, 861 complete and 0 interrupted iterations
default   [  61% ] 25/30 VUs  1m32.0s/2m30.0s

running (1m32.9s), 25/30 VUs, 866 complete and 0 interrupted iterations
default   [  62% ] 25/30 VUs  1m33.0s/2m30.0s

running (1m33.9s), 25/30 VUs, 876 complete and 0 interrupted iterations
default   [  63% ] 25/30 VUs  1m34.0s/2m30.0s

running (1m34.9s), 25/30 VUs, 884 complete and 0 interrupted iterations
default   [  63% ] 25/30 VUs  1m35.0s/2m30.0s

running (1m36.0s), 26/30 VUs, 893 complete and 0 interrupted iterations
default   [  64% ] 26/30 VUs  1m36.0s/2m30.0s

running (1m36.9s), 26/30 VUs, 901 complete and 0 interrupted iterations
default   [  65% ] 26/30 VUs  1m37.0s/2m30.0s

running (1m37.9s), 26/30 VUs, 909 complete and 0 interrupted iterations
default   [  65% ] 26/30 VUs  1m38.0s/2m30.0s

running (1m38.9s), 26/30 VUs, 915 complete and 0 interrupted iterations
default   [  66% ] 26/30 VUs  1m39.0s/2m30.0s

running (1m39.9s), 26/30 VUs, 921 complete and 0 interrupted iterations
default   [  67% ] 26/30 VUs  1m40.0s/2m30.0s

running (1m40.9s), 26/30 VUs, 929 complete and 0 interrupted iterations
default   [  67% ] 26/30 VUs  1m41.0s/2m30.0s

running (1m41.9s), 26/30 VUs, 940 complete and 0 interrupted iterations
default   [  68% ] 26/30 VUs  1m42.0s/2m30.0s

running (1m42.9s), 27/30 VUs, 945 complete and 0 interrupted iterations
default   [  69% ] 27/30 VUs  1m43.0s/2m30.0s

running (1m43.9s), 27/30 VUs, 954 complete and 0 interrupted iterations
default   [  69% ] 27/30 VUs  1m44.0s/2m30.0s

running (1m44.9s), 27/30 VUs, 967 complete and 0 interrupted iterations
default   [  70% ] 27/30 VUs  1m45.0s/2m30.0s

running (1m45.9s), 27/30 VUs, 971 complete and 0 interrupted iterations
default   [  71% ] 27/30 VUs  1m46.0s/2m30.0s

running (1m46.9s), 27/30 VUs, 984 complete and 0 interrupted iterations
default   [  71% ] 27/30 VUs  1m47.0s/2m30.0s

running (1m47.9s), 27/30 VUs, 993 complete and 0 interrupted iterations
default   [  72% ] 27/30 VUs  1m48.0s/2m30.0s

running (1m48.9s), 28/30 VUs, 999 complete and 0 interrupted iterations
default   [  73% ] 28/30 VUs  1m49.0s/2m30.0s

running (1m49.9s), 28/30 VUs, 1007 complete and 0 interrupted iterations
default   [  73% ] 28/30 VUs  1m50.0s/2m30.0s

running (1m50.9s), 28/30 VUs, 1022 complete and 0 interrupted iterations
default   [  74% ] 28/30 VUs  1m51.0s/2m30.0s

running (1m51.9s), 28/30 VUs, 1029 complete and 0 interrupted iterations
default   [  75% ] 28/30 VUs  1m52.0s/2m30.0s

running (1m52.9s), 28/30 VUs, 1038 complete and 0 interrupted iterations
default   [  75% ] 28/30 VUs  1m53.0s/2m30.0s

running (1m53.9s), 28/30 VUs, 1046 complete and 0 interrupted iterations
default   [  76% ] 28/30 VUs  1m54.0s/2m30.0s

running (1m54.9s), 29/30 VUs, 1055 complete and 0 interrupted iterations
default   [  77% ] 29/30 VUs  1m55.0s/2m30.0s

running (1m55.9s), 29/30 VUs, 1068 complete and 0 interrupted iterations
default   [  77% ] 29/30 VUs  1m56.0s/2m30.0s

running (1m56.9s), 29/30 VUs, 1075 complete and 0 interrupted iterations
default   [  78% ] 29/30 VUs  1m57.0s/2m30.0s

running (1m57.9s), 29/30 VUs, 1083 complete and 0 interrupted iterations
default   [  79% ] 29/30 VUs  1m58.0s/2m30.0s

running (1m58.9s), 29/30 VUs, 1091 complete and 0 interrupted iterations
default   [  79% ] 29/30 VUs  1m59.0s/2m30.0s

running (2m00.0s), 30/30 VUs, 1102 complete and 0 interrupted iterations
default   [  80% ] 30/30 VUs  2m00.0s/2m30.0s

running (2m00.9s), 30/30 VUs, 1108 complete and 0 interrupted iterations
default   [  81% ] 30/30 VUs  2m01.0s/2m30.0s

running (2m01.9s), 30/30 VUs, 1118 complete and 0 interrupted iterations
default   [  81% ] 30/30 VUs  2m02.0s/2m30.0s

running (2m02.9s), 30/30 VUs, 1126 complete and 0 interrupted iterations
default   [  82% ] 30/30 VUs  2m03.0s/2m30.0s

running (2m03.9s), 30/30 VUs, 1135 complete and 0 interrupted iterations
default   [  83% ] 30/30 VUs  2m04.0s/2m30.0s

running (2m04.9s), 27/30 VUs, 1146 complete and 0 interrupted iterations
default   [  83% ] 27/30 VUs  2m05.0s/2m30.0s

running (2m05.9s), 27/30 VUs, 1155 complete and 0 interrupted iterations
default   [  84% ] 27/30 VUs  2m06.0s/2m30.0s

running (2m06.9s), 25/30 VUs, 1162 complete and 0 interrupted iterations
default   [  85% ] 25/30 VUs  2m07.0s/2m30.0s

running (2m07.9s), 24/30 VUs, 1173 complete and 0 interrupted iterations
default   [  85% ] 24/30 VUs  2m08.0s/2m30.0s

running (2m08.9s), 24/30 VUs, 1181 complete and 0 interrupted iterations
default   [  86% ] 24/30 VUs  2m09.0s/2m30.0s

running (2m09.9s), 23/30 VUs, 1187 complete and 0 interrupted iterations
default   [  87% ] 23/30 VUs  2m10.0s/2m30.0s

running (2m10.9s), 21/30 VUs, 1195 complete and 0 interrupted iterations
default   [  87% ] 21/30 VUs  2m11.0s/2m30.0s

running (2m11.9s), 20/30 VUs, 1200 complete and 0 interrupted iterations
default   [  88% ] 20/30 VUs  2m12.0s/2m30.0s

running (2m12.9s), 18/30 VUs, 1210 complete and 0 interrupted iterations
default   [  89% ] 18/30 VUs  2m13.0s/2m30.0s

running (2m13.9s), 17/30 VUs, 1219 complete and 0 interrupted iterations
default   [  89% ] 17/30 VUs  2m14.0s/2m30.0s

running (2m14.9s), 17/30 VUs, 1230 complete and 0 interrupted iterations
default   [  90% ] 17/30 VUs  2m15.0s/2m30.0s

running (2m15.9s), 15/30 VUs, 1242 complete and 0 interrupted iterations
default   [  91% ] 15/30 VUs  2m16.0s/2m30.0s

running (2m16.9s), 15/30 VUs, 1252 complete and 0 interrupted iterations
default   [  91% ] 15/30 VUs  2m17.0s/2m30.0s

running (2m17.9s), 14/30 VUs, 1260 complete and 0 interrupted iterations
default   [  92% ] 14/30 VUs  2m18.0s/2m30.0s

running (2m18.9s), 12/30 VUs, 1268 complete and 0 interrupted iterations
default   [  93% ] 12/30 VUs  2m19.0s/2m30.0s

running (2m20.0s), 11/30 VUs, 1275 complete and 0 interrupted iterations
default   [  93% ] 11/30 VUs  2m20.0s/2m30.0s

running (2m20.9s), 10/30 VUs, 1285 complete and 0 interrupted iterations
default   [  94% ] 10/30 VUs  2m21.0s/2m30.0s

running (2m21.9s), 09/30 VUs, 1293 complete and 0 interrupted iterations
default   [  95% ] 09/30 VUs  2m22.0s/2m30.0s

running (2m22.9s), 08/30 VUs, 1301 complete and 0 interrupted iterations
default   [  95% ] 08/30 VUs  2m23.0s/2m30.0s

running (2m23.9s), 08/30 VUs, 1307 complete and 0 interrupted iterations
default   [  96% ] 08/30 VUs  2m24.0s/2m30.0s

running (2m24.9s), 06/30 VUs, 1318 complete and 0 interrupted iterations
default   [  97% ] 06/30 VUs  2m25.0s/2m30.0s

running (2m25.9s), 05/30 VUs, 1327 complete and 0 interrupted iterations
default   [  97% ] 05/30 VUs  2m26.0s/2m30.0s

running (2m26.9s), 04/30 VUs, 1334 complete and 0 interrupted iterations
default   [  98% ] 04/30 VUs  2m27.0s/2m30.0s

running (2m27.9s), 03/30 VUs, 1341 complete and 0 interrupted iterations
default   [  99% ] 03/30 VUs  2m28.0s/2m30.0s

running (2m28.9s), 02/30 VUs, 1353 complete and 0 interrupted iterations
default   [  99% ] 02/30 VUs  2m29.0s/2m30.0s

running (2m29.9s), 01/30 VUs, 1359 complete and 0 interrupted iterations
default   [ 100% ] 01/30 VUs  2m30.0s/2m30.0s

     data_received..................: 226 kB 1.5 kB/s
     data_sent......................: 144 kB 961 B/s
     http_req_blocked...............: avg=91.92µs  min=7.41µs   med=25.54µs  max=11.63ms p(90)=47.64µs  p(95)=106.6µs 
     http_req_connecting............: avg=39.13µs  min=0s       med=0s       max=7.73ms  p(90)=0s       p(95)=0s      
   ✓ http_req_duration..............: avg=1.77s    min=2.67ms   med=1.68s    max=7.12s   p(90)=3.14s    p(95)=3.24s   
       { expected_response:true }...: avg=1.77s    min=2.67ms   med=1.68s    max=7.12s   p(90)=3.14s    p(95)=3.24s   
   ✓ http_req_failed................: 0.00%  ✓ 0        ✗ 1360
     http_req_receiving.............: avg=986.62µs min=56.5µs   med=289.23µs max=40.97ms p(90)=837.12µs p(95)=1.83ms  
     http_req_sending...............: avg=119.38µs min=16.03µs  med=66.98µs  max=10.46ms p(90)=177.64µs p(95)=247.12µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s      p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=1.77s    min=2.48ms   med=1.68s    max=7.12s   p(90)=3.14s    p(95)=3.24s   
     http_reqs......................: 1360   9.064215/s
     iteration_duration.............: avg=1.87s    min=103.96ms med=1.79s    max=7.22s   p(90)=3.24s    p(95)=3.34s   
     iterations.....................: 1360   9.064215/s
     vus............................: 1      min=1      max=30
     vus_max........................: 30     min=30     max=30


running (2m30.0s), 00/30 VUs, 1360 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/30 VUs  2m30s